<!DOCTYPE html>
<html>
--------------包含其他页面---------------------------------------<br>
<#--包含其他head页面-->
<body>
---------------空值转换以及条件判断--------------------------------<br>
<#--空值数据转换处理-->
空值：${nullkey!""}<br/>
缺失：${missing!""}<br/>

<#--nullkey变量空值条件判断-->
<#--如果不为空，则取值，否则打印出“为空”-->
<#if nullkey??>
    不为空,其值为${nullkey??}
    <#else >
        为空
</#if>


<br>---------------日期格式处理--------------------------------------<br>
<#--日期格式处理-->
当前的日期为：${today?date}<br>
当前的日期格式为：${today?datetime}<br>
当前的日期指定格式为：${today?string("yyyy年MM月")}
<br>---------------数字函数--------------------------------------<br>
${point?c}

</body>
</html>